app/controllers/static_pages_controller.rb

  def source
    if(params[:fingerprint] != nil)
      user = User.find_by_fingerprint(params[:fingerprint])
---
SELECT  "users".* FROM "users" WHERE "users"."fingerprint" = ? LIMIT ?  [["fingerprint", "2892496745"], ["LIMIT", 1]]