app/controllers/users_controller.rb

  def create
    @user = User.find_or_create_by!(fingerprint: user_params[:fingerprint])
    @user.update(user_params)
---
INSERT INTO "users" ("fingerprint", "created_at", "updated_at", "name", "password") VALUES (?, ?, ?, ?, ?)  [["fingerprint", "2892496745"], ["created_at", "2020-04-05 22:42:30.700629"], ["updated_at", "2020-04-05 22:42:30.700629"], ["name", "ben"], ["password", "ben"]]
SELECT  "users".* FROM "users" WHERE "users"."fingerprint" = ? LIMIT ?  [["fingerprint", "2892496745"], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "password" = ?, "fingerprint" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "ben"], ["password", "ben"], ["fingerprint", "2892496745"], ["updated_at", "2020-04-05 23:27:37.991068"], ["id", 7]]